# IFC_SetRecEnabled

## Description
Enables/disables the mapped Record.

```pascal
FUNCTION IFC_SetRecEnabled(
				objectName : STRING;
				recordName : STRING;
				bEnable    : BOOLEAN): BOOLEAN;
```

```python
def vs.IFC_SetRecEnabled(objectName, recordName, bEnable):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|objectName|STRING|   |
|recordName|STRING|   |
|bEnable|BOOLEAN|   |

## Version
Availability: from Vectorworks 2023.4

## Category
* IFC